003_mechanicalSimilarity/003_pimpleFoam_Re200_L0.02_U0.15_nu1.5e-5/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type            forceCoeffs;
    libs            (forces);
    writeControl    timeStep;
    writeInterval   1;

    patches         ("hole");
    rho             rhoInf;      // Indicates incompressible
    log             true;
    rhoInf          1;           // Required when rho = rhoInf
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (0 0 0);  // Axle midpoint on ground
    pitchAxis       (0 1 0);
    magUInf         0.15;
    lRef            0.0002;        // Wheelbase length 0.002*0.01
    Aref            0.0002;        // Estimated
    //lRef            2e-3;        // Diameter of cylinder
    //Aref            2e-3;        // Estimated
}


// ************************************************************************* //
