003_mechanicalSimilarity/003_pimpleFoam_Re200_L0.02_U0.15_nu1.5e-5/Allrun.pre
#!/bin/bash

blockMesh
mirrorMesh -dict system/mirrorMeshDict.X -overwrite
mirrorMesh -dict system/mirrorMeshDict.Y -overwrite
autoPatch 45 -overwrite
createPatch -overwrite
extrudeMesh
